# ExternalResourceSubFolder Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceSubFolder Class
Members See Also
---
Data that describes a remote folder to be shown in the file browser dialog
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019.1
# Syntax
C#
---
```text
public class ExternalResourceSubFolder : IDisposable
```

Visual Basic
---
```text
Public Class ExternalResourceSubFolder _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExternalResourceSubFolder : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExternalResourceSubFolder
# See Also
ExternalResourceSubFolder Members
Autodesk.Revit.DB Namespace